tutorials/multiphase/interDyMFoam/ras/floatingObject/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    stationaryWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11200;
        startFace       277808;
    }
    atmosphere
    {
        type            patch;
        nFaces          1600;
        startFace       289008;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          672;
        startFace       290608;
    }
)

// ************************************************************************* //
